package lesson10.task02;

/* 10 чисел наоборот
Вывести на экран числа от 10 до 1 используя цикл while.
*/

public class Solution {
    public static void main(String[] args) throws Exception {
        //Напишите тут ваш код
        int x = 10;
        int num = 0;

        while (num < x) {
            num--;
            System.out.println (num);
        }

    }
}
