package lesson12.home03;

import java.io.InputStream;
import java.io.InputStreamReader;
import java.io.Reader;
import java.io.BufferedReader;

/* Я буду зарабатывать $50 в час
Ввести с клавиатуры число n.
Вывести на экран надпись «Я буду зарабатывать $n в час».
Пример:
Я буду зарабатывать $50 в час
*/

public class Solution {
    public static void main(String[] args)   throws Exception {
        //Напишите тут ваш код
        System.out.println("Я буду зарабатывать $n в час");
    }
}