package lesson10.task04;

/* S-квадрат
Вывести на экран квадрат из 10х10 букв S используя цикл while.
Буквы в одной строке не разделять.
*/

public class Solution {
    public static void main(String[] args) throws Exception {
        //Напишите тут ваш код
        int i = 10;
        int b = 0;

        while (i > b) {
            System.out.println(" S S S S S S S S S S");
            b++;
        }
    }
}
