package lesson05.task01;

/* Создать класс Cat
Создать класс Cat. У кота должно быть имя (name, String), возраст (age, int), вес (weight, int), сила (strength, int).
*/

public class Cat {

    static String name = "cat";
    static int age = 15;
    static int weight = 5;
    static int strength = 8;

    //Напишите тут ваш код
    public static void main (String args[]) {
        System.out.println(name + " " + age + " " + weight + " " + strength);
    }
}
